app/controllers/creatures_controller.rb

SELECT "creatures".* FROM "creatures"
---
  def index
    @creatures = Creature.all

SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 32]]
---
  def edit
  @creature = Creature.find(params[:id])

SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 32]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = 32  [["description", "purple"], ["updated_at", "2015-01-09 18:34:52.254199"]]
---
  def update
  @creature = Creature.find(params[:id])
    @creature.update(creature_params)

SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 0]]
---
  def show
    @creature = Creature.find(params[:id])

INSERT INTO "creatures" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-01-09 18:25:18.755673"], ["description", "test"], ["name", "test"], ["updated_at", "2015-01-09 18:25:18.755673"]]
---
  def create
    @creature = Creature.new(creature_params)

    @creature.save

SELECT  "creatures".* FROM "creatures"  WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 1]]
---
  def destroy
    @creature = Creature.find(params[:id])
    @creature.destroy